<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest FMOD Studio disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.gkluoe.pkg.fmodstudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FMODStudio</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.gkluoe.download.fmodstudio</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>FMOD Studio</string>
			<key>destination_path</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/</string>
                    </dict>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                    <key>id</key>
                    <string>org.fmod.fmodstudio</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
